W12D3_bench_bnb/app/models/user.rb

    def self.find_by_credentials(username, password)
      @user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "applesauce"], ["LIMIT", 1]]

    def self.find_by_credentials(username, password)
      @user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "AppleSauce"], ["LIMIT", 1]]

    def reset_session_token!
      # debugger
      self.session_token = SecureRandom::urlsafe_base64
      self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "qZ8WiawKLoh7n8v-wjyvoA"], ["updated_at", "2022-03-17 00:54:20.197195"], ["id", 1]]