W6D3_first_routes_ctrl/app/controllers/artworks_controller.rb

    def index
        potato = Artwork.all
---
SELECT "artworks".* FROM "artworks"

    def show
        mayo = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def update
        egg = Artwork.find(params[:id])
        if egg.update(user_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "'highschooltraumas.org'"], ["updated_at", "2022-02-04 00:57:13.385056"], ["id", 1]]

    def destroy
        onion = Artwork.find(params[:id])
        if onion.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]

    def create
        mustard = Artwork.new(user_params)
        if mustard.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Neighbors are Crazy"], ["image_url", "mostwantedstompers.com"], ["artist_id", 1], ["created_at", "2022-02-04 01:22:31.038070"], ["updated_at", "2022-02-04 01:22:31.038070"]]