W6D5_ninety_nine_cats/app/views/cats/show.html.erb

  </tr>
  <% @cat.rental_requests.order('start_date').each do |req| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = ? ORDER BY start_date  [["cat_id", 3]]