first_routes_ctrl/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # render plain: "Whatever we want in index"
        sleepy_1 = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "'kishi'"], ["email", "'stopeatingsugar@gmail.com'"], ["created_at", "2022-02-03 00:38:20.997609"], ["updated_at", "2022-02-03 00:38:20.997609"]]
---
    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save!