W6D5_cats/app/controllers/cats_controller.rb

    def index
        @cats = Cat.all #adding @ makes it accessible thoughout the project
---
SELECT "cats".* FROM "cats"