W7D2_music/tiny_tracks/app/models/user.rb

    def self.find_by_credentials(email, password)
        user = User.find_by(username: password)
---
SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT ?  [["LIMIT", 1]]