W7D2_music/tiny_tracks/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64 #generates actual session token
        self.save! #saving the generated session token to the user instance
---
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "AV4gfgF5-4_mLSEj6b8BfA"], ["updated_at", "2022-02-09 02:10:22.472637"], ["id", 1]]

    def self.find_by_credentials(email, password) #why is password nil?
        #print user, email, password
        # debugger
        user = User.find_by(email: email)#takes in options hash
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "somethingdum@gmail.com"], ["LIMIT", 1]]