W6D5_ninety_nine_cats/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)
        if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        @cat = Cat.find(params[:id])
        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = ?, "color" = ?, "description" = ?, "name" = ?, "sex" = ?, "updated_at" = ? WHERE "cats"."id" = ?